!****************************************************************************************************
!这是原子有限元的主程序，原子有限元的各个部分已经模块化成子程序，具体包括如下模块：
!
!****************************************************************************************************
program afem

!使用afem_parameter模块（其中定义了参数）
use afem_parameter

!默认情况下需要声明变量
implicit none

    !定义变量（这些变量的作用是在几个主要的子程序之间传递重要参数）
    !比如：
    !将initial_data_input子程序中的节点坐标传入K_element_assembling子程序形成单元刚度阵
    !将K_element_assembling子程序生成的全局刚度阵传入solution_gauss子程序求解
    !将solution_gauss子程序的求解结果传入result_output子程序进行结果的输出
    
    !定义循环变量
    integer(kind=4) i, j, k
    
    !定义CPU占用计时变量
    real(kind=8) time_begin, time_end
    
    open(1, file = 'time_all.txt')
    
    !CPU计时程序（计时开始）
    call CPU_TIME(time_begin)
    
    !
    write(*,"(/,'***************************** Si atoms - begin *****************************',/)")
    
    write(*,"(/,'1.**************************************************************',/,1X,'开始生成节点位置：',/)")
    !调用初始数据生成子程序
    call initial_data_input()
    
    !将原子坐标以文件形式输出
    call output_node_position()
    write(*,"(/,1X,'节点位置生成结束。',/,'1.**************************************************************',/)")
    
    
    write(*,"(/,'2.**************************************************************',/,1X,'开始生成单元：',/)")
    write(*,"(/,1X,'初始分配的全局单元数为：',I10)") amount_all_elements
    !调用子程序形成单元
    call element()
    
    !将单元及所包含的原子以文件形式输出
    call output_element()
    write(*,"(/,1X,'单元生成结束。',/,'2.**************************************************************',/)")
    
    
    
    !write(*,"('DOF/3 = ')") DOF
    !write(*,"('main_node_of_element = ')") main_node_of_element
    !write(*,"('node_position = ')") node_position
    
    !为全局刚度阵分配内存空间
    DOF = DOF - 3*amount_node_clear; allocate(K_global(DOF, DOF))
    
    !DOF_global = DOF - 3*amount_node_clear; allocate(K_global(DOF_global, DOF_global))
    
    
    write(*,"(/,'3.**************************************************************',/,1X,'开始形成全局刚度阵：',/)")
    !生成全局刚度阵
    !call K_global_assembling()
    call K_global_assembling()
    
    !将全局刚度矩阵以文件形式输出
    call output_K_global()
    write(*,"(/,1X,'全局刚度阵生成结束。',/,'3.**************************************************************',/)")
    
    
    write(*,"(/,'4.**************************************************************',/,1X,'开始输入载荷：',/)")
    !调用边界条件输入子程序（可以调用）
    call loads_input()
    write(*,"(/,1X,'载荷输入结束。',/,'4.**************************************************************',/)")
    
    
    write(*,"(/,'5.**************************************************************',/,1X,'开始形成力列阵：',/)")
    !将全局力列阵以文件形式输出
    call output_force_of_node()
    write(*,"(/,1X,'力列阵形成结束。',/,'5.**************************************************************',/)")
    
    
    write(*,"(/,'6.**************************************************************',/,1X,'开始引入边界条件：',/)")
    !利用边界条件（零位移）消除总刚奇异性
    !1*1*1阶晶胞的时候全局刚度阵为42*42阶的，全局刚度阵的秩为39，说明需要消除3阶奇异性
    !其他任意阶晶胞都相同
    !暂时会选择3个不同的原子分别固定X/Y/Z的3个方向自由度来消除奇异性
    call boundary_conditions_introduced_1(3)
    write(*,"(/,1X,'边界条件引入结束。',/,'6.**************************************************************',/)")
    
    
    write(*,"(/,'7.**************************************************************',/,1X,'输出引入边界条件后的全局刚度阵：',/)")
    !输出引入边界条件后的全局刚度阵
    call output_K_global_new()
    write(*,"(/,1X,'引入边界条件后的全局刚度阵输出结束。',/,'7.**************************************************************',/)")
    
    
    
    !暂时不用
    !利用边界条件（给定位移）消除总刚奇异性
    !call boundary_conditions_introduced_2(3)
    
    
    write(*,"(/,'8.**************************************************************',/,1X,'开始高斯求解：',/)")
    !有限元方程的求解
    call solution_gauss()
    write(*,"(/,1X,'高斯求解结束。',/,'8.**************************************************************',/)")
    
    
    write(*,"(/,'9.**************************************************************',/,1X,'开始输出结果：',/)")
    !输出解矩阵
    call output_solution()
    !i = rank(K_global)
    !write(*,"(1X, '矩阵的秩', I5)") i
    write(*,"(/,1X,'结果输出结束。',/,'9.**************************************************************',/)")
    
    
    !结果输出
    !call result_output()
    
    write(*,"(/,'***************************** Si atoms - end *****************************',/)")
    
    !CPU计时程序（计时结束）
    call CPU_TIME(time_end)
    
    !输出CPU占用时间
    write(1,"(1X, '程序总共占用CPU时间为：', F, 's')") time_end - time_begin
    write(*,"(1X, '程序总共占用CPU时间为：', F, 's')") time_end - time_begin
    
    close(1)
    write(*,"(1X, 'stiffness = ', F)") stiffness
pause
end program afem